<template>
  <v-dialog v-model="dialog" persistent max-width="45vw">
    <v-card>
      <v-card-title>法律声明及隐私权政策</v-card-title>
      <v-card-text
        ><v-textarea v-model="content" rows="30" readonly></v-textarea
      ></v-card-text>
      <v-card-actions>
        <v-layout justify-end>
          <v-btn text @click="$emit('update:dialog', false)"
            >关闭</v-btn
          ></v-layout
        >
      </v-card-actions>
    </v-card>
  </v-dialog>
</template>
<script>
export default {
  props: {
    dialog: {
      type: Boolean,
      required: true
    }
  },
  data: () => ({
    content2:
      '欢迎申请使用 DEVA 提供的问答社区服务，为了保障用户的权益，请在使用 DEVA 的问答社区前，详细阅读本协议。本协议系由用户与 DEVA 就提供的问答社区服务内容而订立的协议。\n' +
      '\n' +
      '当用户注册时，则应视为用户已经详细阅读了本协议的内容，同意并愿意遵守本协议的内容。\n' +
      '\n' +
      '本协议之条款有时可能会更改，本协议一旦发生变动，将会在 DEVA 的重要页面上提示修改内容。如果用户不同意 DEVA 修改的内容，用户可以主动取消获得的网络问答社区服务。如果用户在修改内容公告后15天内未主动取消服务，则视为接受本协议条款的变更；修改内容公告后用户如果仍继续使用 DEVA 提供的问答社区亦构成对本协议条款变更的接受。\n' +
      '\n' +
      '如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款，在取得监护人对本协议全部条款的同意后，方可使用 DEVA 提供的问答社区。\n' +
      '\n' +
      '一、定义及界定\n' +
      '\n' +
      '1.1 "发布内容"，即上载并出现在问答社区上的内容及言论；\n' +
      '\n' +
      '1.2 "发布作品"，无论发布内容的表现形式，凡属文学、艺术和科学领域具有独创性并能以某种有形形式复制的智力成果，均构成本协议所指"发布作品"。\n' +
      '\n' +
      '1.3 "用户"，即依照本协议约定通过实名注册后使用 DEVA 问答社区的个人。包括将其依法所享有著作权或获得著作权人合法授权（或享有其他相关权益及第三方授权）的内容上载，使得该内容出现在 DEVA 的提供者以及仅在社区中浏览帖子或发表言论的社区使用者。\n' +
      '\n' +
      '1.4 灌水：发表与题主讨论及标签定位主旨不相符合的内容的；发表与主题内容严重不符的内容的；发表内容中只包含纯粹的表情符号，而没有文字内容的；所发表内容没有实际意义，如“去睡觉了”、“哎”、“嘿嘿”等的。\n' +
      '\n' +
      '1.5 恶意灌水：大量发表无任何实际意义的主题及回复的；在同一时间段或短期内转贴大量内容而自己不参与讨论或只有只言片语敷衍了事的；在同一时间段或短期内多次回复发贴时间在三个月之前且无实际意义的主题的；发表或回复大量无主题性的图片或表情符号，而不进行任何解释或只有只言片语敷衍塞责等；\n' +
      '\n' +
      '1.6 刷屏：在某一时间段或短期内，在同一问题中，大量重复发表同一内容或无实际意义的主题及回复。\n' +
      '\n' +
      '二、网站承诺\n' +
      '\n' +
      '2.1 DEVA 在国家法律、法规、政策范围内，依照用户指令提供相关内容的上载、储存、链接或搜索等服务， DEVA 不对用户发布内容进行任何编辑、修改或选择，仅作为用户提供内容的发布和搜索平台。\n' +
      '\n' +
      '2.2  DEVA 不能控制用户发布内容的合法性以及其来源、归属，也不承担任何预先审核义务。 DEVA 提醒用户应该通过自己的谨慎判断确定发布内容的合法性和有效性。\n' +
      '\n' +
      '2.3  DEVA 不能控制或保证用户完全遵照本协议发布或使用发布内容， DEVA 提醒用户可能存在用户超出本协议范围进行发布或使用的侵权行为，用户应自行承担因此而产生的一切损失。 DEVA 仅在必要时提供协助义务。\n' +
      '\n' +
      '2.4  DEVA 不涉及任何基于发布内容而产生的包括权属确认、使用授权等在内的一切法律关系及法律纠纷。 DEVA 不以任何形式参与发布用户或者使用用户包括授权使用等在内行为，也拒绝承担基于此所产生的一切责任。\n' +
      '\n' +
      '2.5 用户对使用 DEVA 上的发布内容自行承担风险， DEVA 不就用户的任何行为做任何形式的保证；不保证 DEVA 所提供服务能满足用户的要求，不保证 DEVA 服务不中断，亦不对 DEVA 服务的安全性、正确性、及时性、合法性做任何担保。\n' +
      '\n' +
      '2.6  DEVA 的发布内容，除因站务管理需要并已获得 DEVA 授权而由 DEVA 管理人员发布的公告类帖文外，仅代表该发布用户本人观点，与 DEVA 立场无关。\n' +
      '\n' +
      '2.7 任何由于计算机系统问题、黑客攻击、计算机病毒侵入或发作、因政府管制而造成的暂时性关闭等影响网络正常浏览的不可抗力而造成的个人资料泄露、丢失、被盗用或被窜改等， DEVA 均获得免责。如因系统维护或升级而需暂停服务时，将事先公告。若因线路及非 DEVA 控制范围内的硬件故障或其它不可抗力而导致暂停服务的，暂停服务期间造成的一切不便与损失， DEVA 不负任何责任。\n' +
      '\n' +
      '三、 用户对发布内容的保证及对发布作品的授权\n' +
      '\n' +
      '3.1 用户应保证所发布内容不存在任何违法中华人民共和国法律、法规、政策的内容；不存在任何违背社会风俗、社会道德和互联网一般道德和礼仪的内容；不存在其他任何不当内容。\n' +
      '\n' +
      '特别提示，用户不得发布下列内容：\n' +
      '\n' +
      '反对中华人民共和国宪法所确定的基本原则的；\n' +
      '\n' +
      '危害国家统一、主权和领土完整的；\n' +
      '\n' +
      '泄露国家秘密，危害国家安全或者损害国家荣誉和利益的；\n' +
      '\n' +
      '煽动民族仇恨、民族歧视，破坏民族团结或者侵害民族风俗、习惯的；\n' +
      '\n' +
      '破坏国家宗教政策，宣扬邪教、迷信的；\n' +
      '\n' +
      '散布谣言，扰乱社会秩序，破坏社会稳定的；\n' +
      '\n' +
      '散布淫秽、赌博、暴力或者教唆犯罪的；\n' +
      '\n' +
      '侮辱或者诽谤他人，侵害他人合法权益的；\n' +
      '\n' +
      '危害社会公德或者民族优秀文化传统的；\n' +
      '\n' +
      '宣扬外挂,私服以及木马的相关内容；\n' +
      '\n' +
      '制作、发布、传播、讨论、交流、宣传（涉及网络游戏产品的BUG）等涉及版权、盗版等内容的；\n' +
      '\n' +
      '刊登任何经本公司合理判断为不妥当或者本公司未认可的软件、游戏、文件等在内的主页地址或者链接的行为；\n' +
      '\n' +
      '含有中华人民共和国法律、行政法规禁止的其他内容的。\n' +
      '\n' +
      '3.2 用户保证其发布作品应均系其合法享有著作权的作品或依法取得著作权人授权的作品（及享有相关权益及第三方授权的其他内容）；用户就该作品依法享有的著作权或使用授权能完全满足 DEVA 规则对该作品加以使用；\n' +
      '\n' +
      '3.3 用户自行承担因发布内容及发布作品所产生的一切法律责任，并保证 DEVA 可在法律允许的范围内最大限度享有免责权。\n' +
      '\n' +
      '3.4 如果用户认为 DEVA 上的发布作品侵犯其所享有的著作权，请以书面通知的形式向 DEVA 提供以下信息以便 DEVA 进行移除，通知书应包括以下内容：\n' +
      '\n' +
      '涉嫌侵权发布作品所侵犯的著作权权属证明；\n' +
      '\n' +
      '权利人的姓名（名称）、联系方式、地址、身份证复印件（自然人）、单位登记证明复印件（单位）；\n' +
      '\n' +
      '要求移除的发布作品的准确名称和网络地址；',
    content:
      '提示条款\n' +
      '\n' +
      '您的信任对我们非常重要，我们深知用户信息安全的重要性，我们将按照法律法规要求，采取安全保护措施，保护您的用户信息安全可控。鉴此，DEVA（或简称“我们”）制定本《法律声明及隐私权政策》（以下或简称“声明和政策”）并提醒您：在使用 DEVA 网站的各项服务前，请您务必仔细阅读并透彻理解本《法律声明和隐私权政策》，在确认充分理解并同意后方使用相关产品和服务。一旦您开始使用 DEVA 服务，将被视为对本声明和政策内容的接受和认可。\n' +
      '\n' +
      '如对本声明和政策内容有任何疑问、意见或建议，您可通过 DEVA 的建议提交功能或管理员邮箱（admin@aid.dev）与我们联系。\n\n' +
      '定义\n' +
      '\n' +
      'DEVA：指我们的问答社区官网（以下或简称本站）：（域名 aid.dev）。\n' +
      '\n' +
      '用户信息：用户信息是指您注册 DEVA 网站账户，使用本站的服务以及本站为了向您提供服务，您提交的或者我们收集的用户会员类信息，如姓名、联系方式等。\n' +
      '\n' +
      '业务数据：不同于用户信息，是指本站的用户利用 DEVA 的服务上传、下载、分发等通过本站的技术服务处理的数据。\n' +
      '\n' +
      ' \n' +
      '\n' +
      '\n' +
      '\n' +
      '法律声明\n' +
      '\n' +
      '\n' +
      '\n' +
      '一、权利归属\n' +
      '\n' +
      '1.1.    本站的Logo、“DEVA”等文字、图形及其组合，以及本站站的其他标识、徽记，未经本站书面授权，任何人不得以任何方式展示、使用或做其他处理（包括但不限于复制、传播、展示、镜像、上传、下载），也不得向他人表明您有权展示、使用或做其他处理。\n' +
      '\n' +
      '1.2.    本站所有的产品、服务、技术与所有程序（以下或简称“技术服务”）的知识产权均归属于本站权利人所有。\n' +
      '\n' +
      '    \n' +
      '\n' +
      ' 二、责任限制\n' +
      '\n' +
      '2.1.    本站用户在本站自行上传、提供、发布相关信息，包括但不限于用户名称、资讯、博客内容、发布内容等均由用户自行提供，本站的用户须对其提供的任何信息依法承担全部责任。\n' +
      '\n' +
      '2.2.    本站上转载作品（包括论坛内容）出于传递更多信息之目的，并不意味 DEVA 赞同其观点或证实其内容的真实性。DEVA 在国家法律、法规、政策范围内，依照用户指令提供相关内容的上载、储存、链接或搜索等服务， DEVA 不对用户发布内容进行任何编辑、修改或选择，仅作为用户提供内容的发布和搜索平台。DEVA 不能控制用户发布内容的合法性以及其来源、归属，也不承担任何预先审核义务。 DEVA 提醒用户应该通过自己的谨慎判断确定发布内容的合法性和有效性。\n' +
      '\n' +
      '2.3.    本站在此提示，您在使用本站服务期间应当遵守中华人民共和国的法律，不得危害网络安全，不得利用 DEVA 的服务从事他人侵犯名誉、隐私、知识产权和其他合法权益的活动。尽管有前述提示，本站不对您使用本站服务的用途和目的承担任何责任。\n' +
      '\n' +
      ' \n' +
      '\n' +
      '三、知识产权保护\n' +
      '\n' +
      '我们尊重知识产权，反对并打击侵犯知识产权的行为。任何组织或个人认为本站的网页（含aid.dev网页内容）内容（如转载文章、问题内容）可能侵犯其合法权益的，可以通过向本站管理员（邮箱：admin@aid.dev）提出书面权利通知，管理员将在收到知识产权权利人合格通知后依法尽快处理。\n' +
      '\n' +
      ' \n' +
      '\n' +
      ' \n' +
      '\n' +
      '\n' +
      '\n' +
      ' 隐私权政策\n' +
      '\n' +
      '\n' +
      '\n' +
      'DEVA（以下或称为“我们”）尊重并保护用户信息，并且将以高度勤勉和审慎的义务对待这些信息。在您使用了本站提供的服务时，我们将按照本隐私权政策收集、处理及披露您的信息。我们希望通过本隐私权政策向您清晰地介绍我们对您信息的处理方式，因此我们建议您完整地阅读本隐私权政策，以帮助您了解维护自己隐私权的方式。\n' +
      '\n' +
      '如果您有任何疑问、意见或建议，请通过本站提供的各种联系方式与我们联系。\n' +
      '\n' +
      '本政策将帮助您了解以下内容：\n' +
      '\n' +
      '一、本协议的适用范围\n' +
      '\n' +
      '二、我们如何收集和使用您的用户信息\n' +
      '\n' +
      '三、我们如何共享、转让、公开披露您的用户信息\n' +
      '\n' +
      '四、用户业务数据和公开信息\n' +
      '\n' +
      '五、您如何管理您的用户信息\n' +
      '\n' +
      '六、我们如何使用cookie和同类技术\n' +
      '\n' +
      '七、我们如何保护和保存您的用户信息\n' +
      '\n' +
      '八、未成年人用户信息的特别约定\n' +
      '\n' +
      '九、隐私权政策的更新\n' +
      '\n' +
      '十、如何联系我们\n' +
      '\n' +
      ' \n' +
      '\n' +
      ' 一、    本协议的适用范围\n' +
      '\n' +
      '1.1.    本隐私权政策适用于本站所有服务。服务包括向您提供页面浏览、网站登录服务，以及通过本站向您提供的技术服务。\n' +
      '\n' +
      ' \n' +
      '\n' +
      '二、     我们如何收集和使用您的用户信息\n' +
      '\n' +
      '（一）我们收集您的用户信息的情形\n' +
      '\n' +
      '2.1.  帮助您成为我们的会员\n' +
      '\n' +
      '2.1.1. 当您在本站站创建账户时，您须向我们提供会员名，设置、确认您的登录密码，提供您在中华人民共和国境内手机号码。您提交的手机号码用于您注册、登录、绑定账户、密码找回时接受验证码，并且作为您与 DEVA 指定的联系方式之一，用来接受相关业务通知（如新品上线、服务变更等）。\n' +
      '\n' +
      '2.1.2. 在您注册完成 DEVA 账户后，您可以在安全设置中设置您的绑定邮箱以供其他用户联系您，此邮箱是公开邮箱，如您不想让其他用户联系您，可不设置\n' +
      '\n' +
      '2.1.3. 如果您仅需使用 DEVA 网站的浏览、搜索等基本服务，您不需要注册成为我们的会员及提供上述信息。\n' +
      '\n' +
      '\n' +
      '（二）我们使用您的用户信息的情形\n' +
      '\n' +
      '2.3.   我们出于如下目的，使用您提交以及我们收集的用户信息：\n' +
      '\n' +
      '2.3.1. 为了向您提供服务，我们会向您发送信息、通知或与您进行业务沟通，包括但不限于为保证服务完成所必须的验证码、使用服务时所必要的推送通知；\n' +
      '\n' +
      '2.3.2. 为了维护、改进服务，向您提供更符合您个性化需求的信息展示，我们可能将来自 DEVA 网站某项服务的用户信息与来自其他项服务的信息结合起来，做出特征模型并进行用户画像，向您展示、推送信息和可能的商业广告，包括但不限于关于 DEVA 产品的新闻以及市场活动及优惠促销信息、 DEVA 合作第三方的推广信息，或其他您可能感兴趣的内容。如果您不想接收我们给您发送的商业性电子信息，您可通过短信提示回复退订或根据信息中提供的退订方式予以退订；\n' +
      '\n' +
      '2.3.3. 我们可能以用户信息统计数据为基础，设计、开发、推广全新的产品及服务；我们会对我们的服务使用情况进行统计，并可能会与公众或第三方分享这些统计信息，但这些统计信息不包含您的任何身份识别信息；\n' +
      '\n' +
      '2.3.4. 为提高您使用我们及我们关联公司、合作伙伴提供服务的安全性，确保操作环境安全与识别账号异常状态，保护您或其他用户或公众的人身财产安全免遭侵害，更好地预防钓鱼网站、欺诈、网络漏洞、计算机病毒、网络攻击、网络侵入等安全风险，更准确地识别违反法律法规或 DEVA 相关协议、规则的情况，我们可能使用您的会员信息、并整合设备信息、有关网络日志以及我们关联公司、合作伙伴合法分享的信息，来判断您账户及交易风险、进行身份验证、安全事件的检测及防范，并依法采取必要的记录、审计、分析、处置措施；\n' +
      '\n' +
      '2.3.5. 如超出收集用户信息时所声称的目的，或者在超出具有直接或合理关联的范围使用用户信息前，我们会再次向您告知并征得您的明示同意。\n' +
      '\n' +
      '\n' +
      '\n' +
      '三、    我们如何共享、转让、公开披露您的用户信息\n' +
      '\n' +
      '3.1. 共享\n' +
      '\n' +
      '我们不会与其他组织和个人共享您的用户信息，但以下情况除外：\n' +
      '\n' +
      '3.1.1.在获取明确同意的情况下共享：获得您的明确同意后，我们会与其他方共享您的用户信息；\n' +
      '\n' +
      '3.1.2.在法定情形下的共享：我们可能会根据法律法规规定、诉讼、仲裁解决需要，或按行政、司法机关依法提出的要求，对外共享您的用户信息；\n' +
      '\n' +
      '3.1.3.为了促成交易或协助解决争议，某些情况下只有共享您的用户信息，才能促成交易或处理您与他人的纠纷或争议，例如，在 DEVA 云市场上创建的某一交易中，如交易任何一方履行或部分履行了交易义务并提出信息披露请求的， DEVA 有权决定向该用户提供其交易对方的联络方式等必要信息，以促成交易的完成；\n' +
      '\n' +
      '3.1.4.与授权合作伙伴共享：我们可能委托受信赖的合作伙伴来提供服务，因此我们可能会与合作伙伴共享您的某些用户信息，以提供更好的客户服务和优化用户体验。我们仅会出于合法、正当、必要、特定、明确的目的共享您的用户信息，并且只会共享提供服务所必要的用户信息。我们的合作伙伴无权将共享的用户信息用于任何其他用途。\n' +
      '\n' +
      '目前，我们的授权合作伙伴包括如下类型：供应商、服务提供商和其他合作伙伴。我们将信息发送给支持我们业务的供应商、服务提供商和其他合作伙伴，这些支持包括提供基础技术服务、提供咨询、分析等专业服务。\n' +
      '\n' +
      '对我们与之共享用户信息的公司、组织和个人，我们会与其签署严格的保密协议以及信息保护约定，要求他们按照我们的说明、本隐私权政策以及其他任何相关的保密和安全措施来处理用户信息。\n' +
      '\n' +
      '3.2. 转让\n' +
      '\n' +
      '我们不会将您的用户信息转让给任何公司、组织和个人，但以下情况除外：\n' +
      '\n' +
      '3.2.1. 在获取明确同意的情况下转让：获得您的明确同意后，我们会向其他方转让您的用户信息；\n' +
      '\n' +
      '3.2.2. 在 DEVA 与其他法律主体者发生合并、收购或破产清算情形，或其他涉及合并、收购或破产清算情形时，如涉及到用户信息转让，我们会要求新的持有您用户信息的公司、组织继续受本政策的约束，否则我们将要求该公司、组织和个人重新向您征求授权同意。\n' +
      '\n' +
      '3.3. 公开披露\n' +
      '\n' +
      '我们仅会在以下情况下，公开披露您的用户信息：\n' +
      '\n' +
      '3.3.1. 获得您明确同意或基于您的主动选择，我们可能会公开披露您的用户信息；\n' +
      '\n' +
      '3.3.2. 或为保护 DEVA 平台及其关联公司用户或公众的人身财产安全免遭侵害，我们可能依据适用的法律或 DEVA 平台相关协议、规则披露关于您的用户信息。例如，若您作为云市场服务商销售假货或盗版商品，我们可能会公开披露您的店铺主体信息与处罚情况。\n' +
      '\n' +
      '3.4.   共享、转让、公开披露用户信息时事先征得授权同意的例外\n' +
      '\n' +
      '以下情形中，共享、转让、公开披露您的用户信息无需事先征得您的授权同意：\n' +
      '\n' +
      '3.4.1. 与国家安全、国防安全有关的；\n' +
      '\n' +
      '3.4.2. 与公共安全、公共卫生、重大公共利益有关的；\n' +
      '\n' +
      '3.4.3. 与犯罪侦查、起诉、审判和判决执行等有关的；\n' +
      '\n' +
      '3.4.4. 出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；\n' +
      '\n' +
      '3.4.5. 您自行向社会公众公开的个人信息；\n' +
      '\n' +
      '3.4.6. 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道。\n' +
      '\n' +
      ' \n' +
      '\n' +
      '四、 用户业务数据和公开信息\n' +
      '\n' +
      '不同于您的用户信息，对于用户业务数据和公开信息， DEVA 将按如下方式处理：\n' +
      '\n' +
      '4.1. 用户业务数据\n' +
      '\n' +
      '4.1.1. 您通过 DEVA 提供的服务，加工、存储、上传、下载、分发以及通过其他方式处理的数据，均为您的用户业务数据，您完全拥有您的用户业务数据。\n' +
      '\n' +
      '4.1.2. 您应对您的用户业务数据来源及内容负责， DEVA 提示您谨慎判断数据来源及内容的合法性。因您的用户业务数据内容违反法律法规、部门规章或国家政策而造成的全部结果及责任均由您自行承担。\n' +
      '\n' +
      '4.1.3. 根据您与 DEVA 协商一致， DEVA 在您选定的数据中心存储用户业务数据。 DEVA 恪守对用户的安全承诺，根据适用的法律保护用户存储在 DEVA 数据中心的数据。\n' +
      '\n' +
      '4.2. 公开信息\n' +
      '\n' +
      '4.2.1. 公开信息是指您公开分享的任何信息，任何人都可以在使用和未使用 DEVA 网站服务期间查看或访问这些信息。例如您在 DEVA 开发者论坛发布的信息。\n' +
      '\n' +
      '4.2.2. 为使用 DEVA 网站服务，可能存在您必须公开分享的信息。\n' +
      '\n' +
      '\n' +
      '\n' +
      '五、  您如何管理您的用户信息\n' +
      '\n' +
      '5.1.   您可以登录 DEVA 网站“个人中心/安全设置”查询、管理（变更、删除）使用 DEVA 服务时而提交的基本业务信息（基本资料）和联系人信息。\n' +
      '\n' +
      '5.2.   在以下情形中，您可以向我们提出删除用户信息的请求：\n' +
      '\n' +
      '5.2.1. 如果我们处理用户信息的行为违反法律法规；\n' +
      '\n' +
      '5.2.2. 如果我们收集、使用您的用户信息，却未征得您的明确同意；\n' +
      '\n' +
      '5.2.3. 如果我们处理个人信息的行为严重违反了与您的约定。\n' +
      '\n' +
      '为保障安全，您可能需要提供书面请求，或以其他方式证明您的身份。我们可能会先要求您验证自己的身份，然后再处理您的请求。\n' +
      '\n' +
      '\n' +
      '\n' +
      '六、  我们如何使用Cookie 和同类技术\n' +
      '\n' +
      '6.1.   为确保网站正常运转、为您获得更轻松的访问体验、向您推荐您可能感兴趣的内容，我们会在您的计算机或移动设备上存储名为 Cookie 的小数据文件。Cookie 通常包含标识符、站点名称以及一些号码和字符。 DEVA 只能读取 DEVA 提供的cookies。\n' +
      '\n' +
      '6.2.   借助于 Cookie，能够存储您的登录信息及个人设置等数据。当下一次您再次访问的时候，我们将显示您需要的信息；或由 DEVA 通过cookies文件来辨识您的来源网站，以便 DEVA 能追踪 DEVA 的广告效果。\n' +
      '\n' +
      '6.3.   您可根据自己的偏好管理Cookie，您也可以清除计算机上保存的所有 Cookie。大部分网络浏览器都设有阻止 Cookie 的功能。但如果您这么做，则需要在每一次访问我们的网站时更改用户设置。如需详细了解如何更改浏览器设置，请访问您使用的浏览器的相关设置页面。\n' +
      '\n' +
      '6.4.   除 Cookie 外，我们还会在网站上使用网站信标和像素标签等其他同类技术。例如，我们向您发送的电子邮件可能含有链接至我们网站内容的地址链接，如果您点击该链接，我们则会跟踪此次点击，帮助我们了解您的产品或服务偏好以便于我们主动改善客户服务体验。网站信标通常是一种嵌入到网站或电子邮件中的透明图像。借助于电子邮件中的像素标签，我们能够获知电子邮件是否被打开。如果您不希望自己的活动以这种方式被追踪，则可以随时从我们的寄信名单中退订。\n' +
      '\n' +
      '\n' +
      '\n' +
      '七、我们如何保护和保存您的用户信息\n' +
      '\n' +
      '7.1.   DEVA 非常重视您的信息安全。我们努力采取各种合理的物理、电子和管理方面的安全措施来保护您的用户信息。防止用户信息遭到未经授权访问、公开披露、使用、修改、损坏或丢失。我们会使用加密技术提高用户信息的安全性；我们会使用受信赖的保护机制防止用户信息遭到恶意攻击；我们会部署访问控制机制，尽力确保只有授权人员才可访问用户信息；以及我们会举办安全和隐私保护培训课程，加强员工对于保护用户信息重要性的认识。\n' +
      '\n' +
      '7.2.   我们会采取合理可行的措施，尽力避免收集无关的用户信息。我们只会在达成本政策所述目的所需的期限内保留您的用户信息，除非受到法律的允许。超出上述用户信息保存期限后，我们会对您的个人信息进行删除或匿名化处理。\n' +
      '\n' +
      '7.3.   请使用复杂密码，协助我们保证您的账号安全。我们将尽力保障您发送给我们的任何信息的安全性。如果我们的物理、技术或管理防护设施遭到破坏，导致信息被非授权访问、公开披露、篡改或毁坏，导致您的合法权益受损，我们将承担相应的法律责任。\n' +
      '\n' +
      '7.4.   在不幸发生用户信息安全事件（泄露、丢失等）后，我们将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。我们将及时将事件相关情况以邮件、信函、电话、推送通知等方式告知您，难以逐一告知用户信息主体时，我们会采取合理、有效的方式发布公告。\n' +
      '\n' +
      '7.5.   同时，我们还将按照监管部门要求，上报用户信息安全事件的处置情况。\n' +
      '\n' +
      '7.6.   我们将收集到的您的用户信息存放在中华人民共和国境内，如在符合适用法律规定的情形下因业务需要向境外传输个人信息的，我们会事先征得您的同意，并向您告知用户信息出境的目的、接收方、安全保障措施、安全风险等情况。\n' +
      '\n' +
      '7.7.   如出现 DEVA 产品和服务停止运营的情形，我们会采取合理措施保护您用户信息安全，包括及时停止继续收集用户信息的活动；停止运营的通知将以逐一送达或公告的形式通知用户；并对所持有的个人信息进行删除或匿名化处理等。\n' +
      '\n' +
      '\n' +
      '\n' +
      '八、未成年人用户信息的特别约定\n' +
      '\n' +
      '8.1. 我们主要面向成人提供产品和服务。如您为未成年人，我们要求您请您的父母或监护人仔细阅读本隐私权政策，并在征得您的父母或监护人同意的前提下使用我们的服务或向我们提供信息。\n' +
      '\n' +
      '8.2. 对于经父母或监护人同意使用我们的产品或服务而收集未成年人个人信息的情况，我们只会在法律法规允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用、共享、转让或披露此信息。\n' +
      '\n' +
      '\n' +
      '\n' +
      '九、隐私权政策的更新\n' +
      '\n' +
      '9.1.   我们的隐私权政策可能修订。\n' +
      '\n' +
      '9.2.   未经您明确同意，我们不会限制您按照本隐私权政策所应享有的权利。我们会在专门页面上发布对隐私权政策所做的任何修订。\n' +
      '\n' +
      '9.3.   对于重大修订，我们还会提供更为显著的通知（包括对于某些服务，我们会通过网站公示的方式进行通知甚至向您提供弹窗提示，说明隐私权政策的具体变更内容）。\n' +
      '\n' +
      '9.4.   本政策所指的重大变更包括但不限于：\n' +
      '\n' +
      '9.4.1. 我们的服务模式发生重大变化。如处理用户信息的目的、处理的用户信息类型、用户信息的使用方式等；\n' +
      '\n' +
      '9.4.2. 我们在控制权、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；\n' +
      '\n' +
      '9.4.3. 用户信息共享、转让或公开披露的主要对象发生变化；\n' +
      '\n' +
      '9.4.4. 您参与用户信息处理方面的权利及其行使方式发生重大变化；\n' +
      '\n' +
      '9.4.5. 我们负责处理用户信息安全的责任部门、联络方式及投诉渠道发生变化时；\n' +
      '\n' +
      '9.4.6. 用户信息安全影响评估报告表明存在高风险时。\n' +
      '\n' +
      '我们还会将本隐私权政策的历史版本在网站专门页面存档，供您查阅。\n' +
      '\n' +
      '\n' +
      '\n' +
      '十、如何联系我们\n' +
      '\n' +
      '您对本声明和政策内容有任何疑问和意见，或者您对 DEVA 对本隐私权政策的实践以及操作上有任何疑问和意见，您可通过 DEVA 的投诉、建议提交入口或管理员邮箱（admin@aid.dev）与我们联系。'
  })
}
</script>
